h2zero/n-able-Arduino/boards.txt
BluzDK.name=BluzDK

BluzDK.upload.tool=openocd
BluzDK.upload.target=nrf51
BluzDK.upload.maximum_size=262144

BluzDK.bootloader.tool=openocd

BluzDK.build.mcu=cortex-m0
BluzDK.build.f_cpu=16000000
BluzDK.build.board=BluzDK
BluzDK.build.core=nRF5
BluzDK.build.variant=BluzDK
BluzDK.build.variant_system_lib=
BluzDK.build.float_flags=
BluzDK.build.ldscript=nrf51_{build.chip}.ld
BluzDK.build.lfclk_flags=-DUSE_LFXO
BluzDK.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

BluzDK.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
BluzDK.menu.chip.xxaa.build.chip=xxaa
BluzDK.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
BluzDK.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
BluzDK.menu.chip.xxac.build.chip=xxac
BluzDK.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

BluzDK.menu.custom_config.disable=Disabled
BluzDK.menu.custom_config.enable=Enabled
BluzDK.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
BluzDK.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

BluzDK.menu.main_stack.768=768
BluzDK.menu.main_stack.768.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=768
BluzDK.menu.main_stack.896=896
BluzDK.menu.main_stack.896.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=896
BluzDK.menu.main_stack.1024=1024
BluzDK.menu.main_stack.1024.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1024
BluzDK.menu.main_stack.1152=1152
BluzDK.menu.main_stack.1152.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1152
BluzDK.menu.main_stack.1280=1280
BluzDK.menu.main_stack.1280.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1280
BluzDK.menu.main_stack.1408=1408
BluzDK.menu.main_stack.1408.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1408
BluzDK.menu.main_stack.1536=1536
BluzDK.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
BluzDK.menu.main_stack.1664=1664
BluzDK.menu.main_stack.1664.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1664
BluzDK.menu.main_stack.1792=1792
BluzDK.menu.main_stack.1792.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1792
BluzDK.menu.main_stack.1920=1920
BluzDK.menu.main_stack.1920.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1920
BluzDK.menu.main_stack.2048=2048
BluzDK.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
BluzDK.menu.main_stack.custom=Custom (config file)
BluzDK.menu.main_stack.custom.build.main_stack_flags=

BluzDK.menu.hs_stack.1024=1024
BluzDK.menu.hs_stack.1024.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1024
BluzDK.menu.hs_stack.1152=1152
BluzDK.menu.hs_stack.1152.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1152
BluzDK.menu.hs_stack.1280=1280
BluzDK.menu.hs_stack.1280.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1280
BluzDK.menu.hs_stack.1408=1408
BluzDK.menu.hs_stack.1408.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1408
BluzDK.menu.hs_stack.1536=1536
BluzDK.menu.hs_stack.1536.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1536
BluzDK.menu.hs_stack.1664=1664
BluzDK.menu.hs_stack.1664.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1664
BluzDK.menu.hs_stack.1792=1792
BluzDK.menu.hs_stack.1792.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1792
BluzDK.menu.hs_stack.1920=1920
BluzDK.menu.hs_stack.1920.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1920
BluzDK.menu.hs_stack.2048=2048
BluzDK.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
BluzDK.menu.hs_stack.custom=Custom (config file)
BluzDK.menu.hs_stack.custom.build.hs_stack_flags=

BluzDK.menu.role.all=All
BluzDK.menu.role.all.build.nimble_flags=
BluzDK.menu.role.periph=Peripheral
BluzDK.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BluzDK.menu.role.adv=Advertiser
BluzDK.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BluzDK.menu.role.scan=Scanner
BluzDK.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BluzDK.menu.role.central=Client
BluzDK.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BluzDK.menu.cppDbgLvl.none=None
BluzDK.menu.cppDbgLvl.none.build.cpp_debug=0
BluzDK.menu.cppDbgLvl.error=Error
BluzDK.menu.cppDbgLvl.error.build.cpp_debug=1
BluzDK.menu.cppDbgLvl.warn=Warn
BluzDK.menu.cppDbgLvl.warn.build.cpp_debug=2
BluzDK.menu.cppDbgLvl.info=Info
BluzDK.menu.cppDbgLvl.info.build.cpp_debug=3
BluzDK.menu.cppDbgLvl.debug=Debug
BluzDK.menu.cppDbgLvl.debug.build.cpp_debug=4


CalliopeMini.name=Calliope mini

CalliopeMini.upload.tool=openocd
CalliopeMini.upload.protocol=cmsis-dap
CalliopeMini.upload.target=nrf51
CalliopeMini.upload.maximum_size=262144

CalliopeMini.bootloader.tool=openocd

CalliopeMini.build.mcu=cortex-m0
CalliopeMini.build.f_cpu=16000000
CalliopeMini.build.board=CalliopeMini
CalliopeMini.build.core=nRF5
CalliopeMini.build.variant=CalliopeMini
CalliopeMini.build.variant_system_lib=
CalliopeMini.build.float_flags=
CalliopeMini.build.ldscript=nrf51_{build.chip}.ld
CalliopeMini.build.lfclk_flags=-DUSE_LFXO
CalliopeMini.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

CalliopeMini.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
CalliopeMini.menu.chip.xxaa.build.chip=xxaa
CalliopeMini.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
CalliopeMini.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
CalliopeMini.menu.chip.xxac.build.chip=xxac
CalliopeMini.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

CalliopeMini.menu.custom_config.disable=Disabled
CalliopeMini.menu.custom_config.enable=Enabled
CalliopeMini.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
CalliopeMini.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

CalliopeMini.menu.main_stack.768=768
CalliopeMini.menu.main_stack.768.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=768
CalliopeMini.menu.main_stack.896=896
CalliopeMini.menu.main_stack.896.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=896
CalliopeMini.menu.main_stack.1024=1024
CalliopeMini.menu.main_stack.1024.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1024
CalliopeMini.menu.main_stack.1152=1152
CalliopeMini.menu.main_stack.1152.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1152
CalliopeMini.menu.main_stack.1280=1280
CalliopeMini.menu.main_stack.1280.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1280
CalliopeMini.menu.main_stack.1408=1408
CalliopeMini.menu.main_stack.1408.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1408
CalliopeMini.menu.main_stack.1536=1536
CalliopeMini.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
CalliopeMini.menu.main_stack.1664=1664
CalliopeMini.menu.main_stack.1664.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1664
CalliopeMini.menu.main_stack.1792=1792
CalliopeMini.menu.main_stack.1792.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1792
CalliopeMini.menu.main_stack.1920=1920
CalliopeMini.menu.main_stack.1920.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1920
CalliopeMini.menu.main_stack.2048=2048
CalliopeMini.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
CalliopeMini.menu.main_stack.custom=Custom (config file)
CalliopeMini.menu.main_stack.custom.build.main_stack_flags=

CalliopeMini.menu.hs_stack.1024=1024
CalliopeMini.menu.hs_stack.1024.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1024
CalliopeMini.menu.hs_stack.1152=1152
CalliopeMini.menu.hs_stack.1152.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1152
CalliopeMini.menu.hs_stack.1280=1280
CalliopeMini.menu.hs_stack.1280.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1280
CalliopeMini.menu.hs_stack.1408=1408
CalliopeMini.menu.hs_stack.1408.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1408
CalliopeMini.menu.hs_stack.1536=1536
CalliopeMini.menu.hs_stack.1536.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1536
CalliopeMini.menu.hs_stack.1664=1664
CalliopeMini.menu.hs_stack.1664.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1664
CalliopeMini.menu.hs_stack.1792=1792
CalliopeMini.menu.hs_stack.1792.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1792
CalliopeMini.menu.hs_stack.1920=1920
CalliopeMini.menu.hs_stack.1920.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1920
CalliopeMini.menu.hs_stack.2048=2048
CalliopeMini.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
CalliopeMini.menu.hs_stack.custom=Custom (config file)
CalliopeMini.menu.hs_stack.custom.build.hs_stack_flags=

CalliopeMini.menu.role.all=All
CalliopeMini.menu.role.all.build.nimble_flags=
CalliopeMini.menu.role.periph=Peripheral
CalliopeMini.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
CalliopeMini.menu.role.adv=Advertiser
CalliopeMini.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
CalliopeMini.menu.role.scan=Scanner
CalliopeMini.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
CalliopeMini.menu.role.central=Client
CalliopeMini.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

CalliopeMini.menu.cppDbgLvl.none=None
CalliopeMini.menu.cppDbgLvl.none.build.cpp_debug=0
CalliopeMini.menu.cppDbgLvl.error=Error
CalliopeMini.menu.cppDbgLvl.error.build.cpp_debug=1
CalliopeMini.menu.cppDbgLvl.warn=Warn
CalliopeMini.menu.cppDbgLvl.warn.build.cpp_debug=2
CalliopeMini.menu.cppDbgLvl.info=Info
CalliopeMini.menu.cppDbgLvl.info.build.cpp_debug=3
CalliopeMini.menu.cppDbgLvl.debug=Debug
CalliopeMini.menu.cppDbgLvl.debug.build.cpp_debug=4


ng_beacon.name=ng-beacon

ng_beacon.upload.tool=openocd
ng_beacon.upload.target=nrf51
ng_beacon.upload.maximum_size=262144

ng_beacon.bootloader.tool=openocd

