h2zero/n-able-Arduino/boards.txt
nRF51Dongle.menu.custom_config.disable=Disabled
nRF51Dongle.menu.custom_config.enable=Enabled
nRF51Dongle.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
nRF51Dongle.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

nRF51Dongle.menu.main_stack.768=768
nRF51Dongle.menu.main_stack.768.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=768
nRF51Dongle.menu.main_stack.896=896
nRF51Dongle.menu.main_stack.896.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=896
nRF51Dongle.menu.main_stack.1024=1024
nRF51Dongle.menu.main_stack.1024.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1024
nRF51Dongle.menu.main_stack.1152=1152
nRF51Dongle.menu.main_stack.1152.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1152
nRF51Dongle.menu.main_stack.1280=1280
nRF51Dongle.menu.main_stack.1280.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1280
nRF51Dongle.menu.main_stack.1408=1408
nRF51Dongle.menu.main_stack.1408.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1408
nRF51Dongle.menu.main_stack.1536=1536
nRF51Dongle.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
nRF51Dongle.menu.main_stack.1664=1664
nRF51Dongle.menu.main_stack.1664.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1664
nRF51Dongle.menu.main_stack.1792=1792
nRF51Dongle.menu.main_stack.1792.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1792
nRF51Dongle.menu.main_stack.1920=1920
nRF51Dongle.menu.main_stack.1920.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1920
nRF51Dongle.menu.main_stack.2048=2048
nRF51Dongle.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
nRF51Dongle.menu.main_stack.custom=Custom (config file)
nRF51Dongle.menu.main_stack.custom.build.main_stack_flags=

nRF51Dongle.menu.hs_stack.1024=1024
nRF51Dongle.menu.hs_stack.1024.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1024
nRF51Dongle.menu.hs_stack.1152=1152
nRF51Dongle.menu.hs_stack.1152.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1152
nRF51Dongle.menu.hs_stack.1280=1280
nRF51Dongle.menu.hs_stack.1280.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1280
nRF51Dongle.menu.hs_stack.1408=1408
nRF51Dongle.menu.hs_stack.1408.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1408
nRF51Dongle.menu.hs_stack.1536=1536
nRF51Dongle.menu.hs_stack.1536.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1536
nRF51Dongle.menu.hs_stack.1664=1664
nRF51Dongle.menu.hs_stack.1664.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1664
nRF51Dongle.menu.hs_stack.1792=1792
nRF51Dongle.menu.hs_stack.1792.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1792
nRF51Dongle.menu.hs_stack.1920=1920
nRF51Dongle.menu.hs_stack.1920.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1920
nRF51Dongle.menu.hs_stack.2048=2048
nRF51Dongle.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
nRF51Dongle.menu.hs_stack.custom=Custom (config file)
nRF51Dongle.menu.hs_stack.custom.build.hs_stack_flags=

nRF51Dongle.menu.role.all=All
nRF51Dongle.menu.role.all.build.nimble_flags=
nRF51Dongle.menu.role.periph=Peripheral
nRF51Dongle.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF51Dongle.menu.role.adv=Advertiser
nRF51Dongle.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF51Dongle.menu.role.scan=Scanner
nRF51Dongle.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF51Dongle.menu.role.central=Client
nRF51Dongle.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF51Dongle.menu.cppDbgLvl.none=None
nRF51Dongle.menu.cppDbgLvl.none.build.cpp_debug=0
nRF51Dongle.menu.cppDbgLvl.error=Error
nRF51Dongle.menu.cppDbgLvl.error.build.cpp_debug=1
nRF51Dongle.menu.cppDbgLvl.warn=Warn
nRF51Dongle.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF51Dongle.menu.cppDbgLvl.info=Info
nRF51Dongle.menu.cppDbgLvl.info.build.cpp_debug=3
nRF51Dongle.menu.cppDbgLvl.debug=Debug
nRF51Dongle.menu.cppDbgLvl.debug.build.cpp_debug=4


OSHChip.name=OSHChip

OSHChip.upload.tool=openocd
OSHChip.upload.target=nrf51
OSHChip.upload.maximum_size=262144

OSHChip.bootloader.tool=openocd

OSHChip.build.mcu=cortex-m0
OSHChip.build.f_cpu=16000000
OSHChip.build.board=OSHChip
OSHChip.build.core=nRF5
OSHChip.build.variant=OSHChip
OSHChip.build.variant_system_lib=
OSHChip.build.float_flags=
OSHChip.build.ldscript=nrf51_{build.chip}.ld
OSHChip.build.lfclk_flags=-DUSE_LFXO
OSHChip.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

OSHChip.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
OSHChip.menu.chip.xxaa.build.chip=xxaa
OSHChip.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
OSHChip.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
OSHChip.menu.chip.xxac.build.chip=xxac
OSHChip.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

OSHChip.menu.custom_config.disable=Disabled
OSHChip.menu.custom_config.enable=Enabled
OSHChip.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
OSHChip.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

OSHChip.menu.main_stack.768=768
OSHChip.menu.main_stack.768.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=768
OSHChip.menu.main_stack.896=896
OSHChip.menu.main_stack.896.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=896
OSHChip.menu.main_stack.1024=1024
OSHChip.menu.main_stack.1024.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1024
OSHChip.menu.main_stack.1152=1152
OSHChip.menu.main_stack.1152.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1152
OSHChip.menu.main_stack.1280=1280
OSHChip.menu.main_stack.1280.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1280
OSHChip.menu.main_stack.1408=1408
OSHChip.menu.main_stack.1408.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1408
OSHChip.menu.main_stack.1536=1536
OSHChip.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
OSHChip.menu.main_stack.1664=1664
OSHChip.menu.main_stack.1664.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1664
OSHChip.menu.main_stack.1792=1792
OSHChip.menu.main_stack.1792.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1792
OSHChip.menu.main_stack.1920=1920
OSHChip.menu.main_stack.1920.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1920
OSHChip.menu.main_stack.2048=2048
OSHChip.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
OSHChip.menu.main_stack.custom=Custom (config file)
OSHChip.menu.main_stack.custom.build.main_stack_flags=

OSHChip.menu.hs_stack.1024=1024
OSHChip.menu.hs_stack.1024.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1024
OSHChip.menu.hs_stack.1152=1152
OSHChip.menu.hs_stack.1152.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1152
OSHChip.menu.hs_stack.1280=1280
OSHChip.menu.hs_stack.1280.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1280
OSHChip.menu.hs_stack.1408=1408
OSHChip.menu.hs_stack.1408.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1408
OSHChip.menu.hs_stack.1536=1536
OSHChip.menu.hs_stack.1536.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1536
OSHChip.menu.hs_stack.1664=1664
OSHChip.menu.hs_stack.1664.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1664
OSHChip.menu.hs_stack.1792=1792
OSHChip.menu.hs_stack.1792.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1792
OSHChip.menu.hs_stack.1920=1920
OSHChip.menu.hs_stack.1920.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1920
OSHChip.menu.hs_stack.2048=2048
OSHChip.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
OSHChip.menu.hs_stack.custom=Custom (config file)
OSHChip.menu.hs_stack.custom.build.hs_stack_flags=

