h2zero/n-able-Arduino/boards.txt
TinyBLE.menu.cppDbgLvl.none=None
TinyBLE.menu.cppDbgLvl.none.build.cpp_debug=0
TinyBLE.menu.cppDbgLvl.error=Error
TinyBLE.menu.cppDbgLvl.error.build.cpp_debug=1
TinyBLE.menu.cppDbgLvl.warn=Warn
TinyBLE.menu.cppDbgLvl.warn.build.cpp_debug=2
TinyBLE.menu.cppDbgLvl.info=Info
TinyBLE.menu.cppDbgLvl.info.build.cpp_debug=3
TinyBLE.menu.cppDbgLvl.debug=Debug
TinyBLE.menu.cppDbgLvl.debug.build.cpp_debug=4


Sinobit.name=Sino:bit

Sinobit.upload.tool=openocd
Sinobit.upload.target=nrf51
Sinobit.upload.maximum_size=262144

Sinobit.bootloader.tool=openocd

Sinobit.build.mcu=cortex-m0
Sinobit.build.f_cpu=16000000
Sinobit.build.board=Sinobit
Sinobit.build.core=nRF5
Sinobit.build.variant=Sinobit
Sinobit.build.variant_system_lib=
Sinobit.build.float_flags=
Sinobit.build.ldscript=nrf51_{build.chip}.ld
Sinobit.build.lfclk_flags=-DUSE_LFXO
Sinobit.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

Sinobit.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
Sinobit.menu.chip.xxaa.build.chip=xxaa
Sinobit.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
Sinobit.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
Sinobit.menu.chip.xxac.build.chip=xxac
Sinobit.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

Sinobit.menu.custom_config.disable=Disabled
Sinobit.menu.custom_config.enable=Enabled
Sinobit.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
Sinobit.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

Sinobit.menu.main_stack.768=768
Sinobit.menu.main_stack.768.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=768
Sinobit.menu.main_stack.896=896
Sinobit.menu.main_stack.896.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=896
Sinobit.menu.main_stack.1024=1024
Sinobit.menu.main_stack.1024.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1024
Sinobit.menu.main_stack.1152=1152
Sinobit.menu.main_stack.1152.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1152
Sinobit.menu.main_stack.1280=1280
Sinobit.menu.main_stack.1280.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1280
Sinobit.menu.main_stack.1408=1408
Sinobit.menu.main_stack.1408.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1408
Sinobit.menu.main_stack.1536=1536
Sinobit.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
Sinobit.menu.main_stack.1664=1664
Sinobit.menu.main_stack.1664.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1664
Sinobit.menu.main_stack.1792=1792
Sinobit.menu.main_stack.1792.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1792
Sinobit.menu.main_stack.1920=1920
Sinobit.menu.main_stack.1920.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1920
Sinobit.menu.main_stack.2048=2048
Sinobit.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
Sinobit.menu.main_stack.custom=Custom (config file)
Sinobit.menu.main_stack.custom.build.main_stack_flags=

Sinobit.menu.hs_stack.1024=1024
Sinobit.menu.hs_stack.1024.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1024
Sinobit.menu.hs_stack.1152=1152
Sinobit.menu.hs_stack.1152.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1152
Sinobit.menu.hs_stack.1280=1280
Sinobit.menu.hs_stack.1280.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1280
Sinobit.menu.hs_stack.1408=1408
Sinobit.menu.hs_stack.1408.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1408
Sinobit.menu.hs_stack.1536=1536
Sinobit.menu.hs_stack.1536.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1536
Sinobit.menu.hs_stack.1664=1664
Sinobit.menu.hs_stack.1664.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1664
Sinobit.menu.hs_stack.1792=1792
Sinobit.menu.hs_stack.1792.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1792
Sinobit.menu.hs_stack.1920=1920
Sinobit.menu.hs_stack.1920.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=1920
Sinobit.menu.hs_stack.2048=2048
Sinobit.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
Sinobit.menu.hs_stack.custom=Custom (config file)
Sinobit.menu.hs_stack.custom.build.hs_stack_flags=

Sinobit.menu.role.all=All
Sinobit.menu.role.all.build.nimble_flags=
Sinobit.menu.role.periph=Peripheral
Sinobit.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Sinobit.menu.role.adv=Advertiser
Sinobit.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Sinobit.menu.role.scan=Scanner
Sinobit.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Sinobit.menu.role.central=Client
Sinobit.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Sinobit.menu.cppDbgLvl.none=None
Sinobit.menu.cppDbgLvl.none.build.cpp_debug=0
Sinobit.menu.cppDbgLvl.error=Error
Sinobit.menu.cppDbgLvl.error.build.cpp_debug=1
Sinobit.menu.cppDbgLvl.warn=Warn
Sinobit.menu.cppDbgLvl.warn.build.cpp_debug=2
Sinobit.menu.cppDbgLvl.info=Info
Sinobit.menu.cppDbgLvl.info.build.cpp_debug=3
Sinobit.menu.cppDbgLvl.debug=Debug
Sinobit.menu.cppDbgLvl.debug.build.cpp_debug=4


# nRF52832 variants
###################

Generic_nRF52832.name=Generic nRF52

Generic_nRF52832.upload.tool=openocd
Generic_nRF52832.upload.target=nrf52
Generic_nRF52832.upload.maximum_size=524288

Generic_nRF52832.bootloader.tool=openocd

Generic_nRF52832.build.mcu=cortex-m4
Generic_nRF52832.build.f_cpu=16000000
Generic_nRF52832.build.board=GENERIC
Generic_nRF52832.build.core=nRF5
Generic_nRF52832.build.variant=Generic
Generic_nRF52832.build.variant_system_lib=
Generic_nRF52832.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52832.build.ldscript=nrf52_xxaa.ld
Generic_nRF52832.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

Generic_nRF52832.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52832.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52832.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52832.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52832.menu.lfclk.lfsynt=Synthesized
Generic_nRF52832.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

