h2zero/n-able-Arduino/boards.txt
# nRF52833 variants
###################

Generic_nRF52833.name=Generic nRF52833

Generic_nRF52833.upload.tool=openocd
Generic_nRF52833.upload.target=nrf52
Generic_nRF52833.upload.maximum_size=524288

Generic_nRF52833.bootloader.tool=openocd

Generic_nRF52833.build.mcu=cortex-m4
Generic_nRF52833.build.f_cpu=64000000
Generic_nRF52833.build.board=GENERIC
Generic_nRF52833.build.core=nRF5
Generic_nRF52833.build.variant=Generic
Generic_nRF52833.build.variant_system_lib=
Generic_nRF52833.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52833.build.ldscript=nrf52833_xxaa.ld
Generic_nRF52833.build.extra_flags=-DNRF52_SERIES DNRF52833_XXAA -DUSE_TINYUSB -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

Generic_nRF52833.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52833.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52833.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52833.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52833.menu.lfclk.lfsynt=Synthesized
Generic_nRF52833.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Generic_nRF52833.menu.custom_config.disable=Disabled
Generic_nRF52833.menu.custom_config.enable=Enabled
Generic_nRF52833.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
Generic_nRF52833.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

Generic_nRF52833.menu.main_stack.1536=1536
Generic_nRF52833.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
Generic_nRF52833.menu.main_stack.2048=2048
Generic_nRF52833.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
Generic_nRF52833.menu.main_stack.2560=2560
Generic_nRF52833.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
Generic_nRF52833.menu.main_stack.3072=3072
Generic_nRF52833.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
Generic_nRF52833.menu.main_stack.3584=3584
Generic_nRF52833.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
Generic_nRF52833.menu.main_stack.4096=4096
Generic_nRF52833.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
Generic_nRF52833.menu.main_stack.custom=Custom (config file)
Generic_nRF52833.menu.main_stack.custom.build.main_stack_flags=

Generic_nRF52833.menu.hs_stack.2048=2048
Generic_nRF52833.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
Generic_nRF52833.menu.hs_stack.2560=2560
Generic_nRF52833.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2560
Generic_nRF52833.menu.hs_stack.3072=3072
Generic_nRF52833.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3072
Generic_nRF52833.menu.hs_stack.3584=3584
Generic_nRF52833.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3584
Generic_nRF52833.menu.hs_stack.4096=4096
Generic_nRF52833.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
Generic_nRF52833.menu.hs_stack.custom=Custom (config file)
Generic_nRF52833.menu.hs_stack.custom.build.hs_stack_flags=

Generic_nRF52833.menu.role.all=All
Generic_nRF52833.menu.role.all.build.nimble_flags=
Generic_nRF52833.menu.role.periph=Peripheral
Generic_nRF52833.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Generic_nRF52833.menu.role.adv=Advertiser
Generic_nRF52833.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Generic_nRF52833.menu.role.scan=Scanner
Generic_nRF52833.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Generic_nRF52833.menu.role.central=Client
Generic_nRF52833.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Generic_nRF52833.menu.cppDbgLvl.none=None
Generic_nRF52833.menu.cppDbgLvl.none.build.cpp_debug=0
Generic_nRF52833.menu.cppDbgLvl.error=Error
Generic_nRF52833.menu.cppDbgLvl.error.build.cpp_debug=1
Generic_nRF52833.menu.cppDbgLvl.warn=Warn
Generic_nRF52833.menu.cppDbgLvl.warn.build.cpp_debug=2
Generic_nRF52833.menu.cppDbgLvl.info=Info
Generic_nRF52833.menu.cppDbgLvl.info.build.cpp_debug=3
Generic_nRF52833.menu.cppDbgLvl.debug=Debug
Generic_nRF52833.menu.cppDbgLvl.debug.build.cpp_debug=4


nRF52833DK.name=nRF52833 Dev Kit

nRF52833DK.upload.tool=openocd
nRF52833DK.upload.target=nrf52
nRF52833DK.upload.maximum_size=524288

nRF52833DK.bootloader.tool=openocd

nRF52833DK.build.mcu=cortex-m4
nRF52833DK.build.f_cpu=64000000
nRF52833DK.build.board=nRF52833DK
nRF52833DK.build.core=nRF5
nRF52833DK.build.variant=Generic
nRF52833DK.build.variant_system_lib=
nRF52833DK.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
nRF52833DK.build.ldscript=nrf52833_xxaa.ld
nRF52833DK.build.extra_flags=-DNRF52_SERIES DNRF52833_XXAA -DUSE_TINYUSB -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

nRF52833DK.menu.lfclk.lfxo=Crystal Oscillator
nRF52833DK.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
nRF52833DK.menu.lfclk.lfrc=RC Oscillator
nRF52833DK.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
nRF52833DK.menu.lfclk.lfsynt=Synthesized
nRF52833DK.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

nRF52833DK.menu.custom_config.disable=Disabled
nRF52833DK.menu.custom_config.enable=Enabled
nRF52833DK.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
nRF52833DK.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

nRF52833DK.menu.main_stack.1536=1536
nRF52833DK.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
nRF52833DK.menu.main_stack.2048=2048
nRF52833DK.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
nRF52833DK.menu.main_stack.2560=2560
nRF52833DK.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
nRF52833DK.menu.main_stack.3072=3072
nRF52833DK.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
nRF52833DK.menu.main_stack.3584=3584
nRF52833DK.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
nRF52833DK.menu.main_stack.4096=4096
nRF52833DK.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
nRF52833DK.menu.main_stack.custom=Custom (config file)
nRF52833DK.menu.main_stack.custom.build.main_stack_flags=

nRF52833DK.menu.hs_stack.2048=2048
nRF52833DK.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2048
nRF52833DK.menu.hs_stack.2560=2560
nRF52833DK.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=2560
nRF52833DK.menu.hs_stack.3072=3072
nRF52833DK.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3072
nRF52833DK.menu.hs_stack.3584=3584
nRF52833DK.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=3584
nRF52833DK.menu.hs_stack.4096=4096
nRF52833DK.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
nRF52833DK.menu.hs_stack.custom=Custom (config file)
nRF52833DK.menu.hs_stack.custom.build.hs_stack_flags=

